Revit 2026 API

# RevitAPIPreDocEventArgs Class

---

The base class used for pre events where the arguments must supply access to the document.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs More

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitAPIPreDocEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class RevitAPIPreDocEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class RevitAPIPreDocEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type RevitAPIPreDocEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The RevitAPIPreDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.DB.EventsDocumentClosingEventArgs Autodesk.Revit.DB.EventsDocumentPrintingEventArgs Autodesk.Revit.DB.EventsDocumentReloadingLatestEventArgs Autodesk.Revit.DB.EventsDocumentSavingAsEventArgs Autodesk.Revit.DB.EventsDocumentSavingEventArgs Autodesk.Revit.DB.EventsDocumentSynchronizingWithCentralEventArgs Autodesk.Revit.DB.EventsElementTypeDuplicatingEventArgs Autodesk.Revit.DB.EventsFamilyLoadingIntoDocumentEventArgs Autodesk.Revit.DB.EventsFileExportingEventArgs Autodesk.Revit.DB.EventsFileImportingEventArgs Autodesk.Revit.DB.EventsViewExportingEventArgs Autodesk.Revit.DB.EventsViewPrintingEventArgs Autodesk.Revit.DB.EventsViewsExportingByContextEventArgs Autodesk.Revit.UI.EventsTransferringProjectStandardsEventArgs Autodesk.Revit.UI.EventsViewActivatingEventArgs